{"backend": "tensorflow", "keras_version": "2.1.3", "config": [{"config": {"trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "gamma_constraint": null, "beta_constraint": null, "batch_input_shape": [null, 96, 96, 1], "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "dtype": "float32", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_1", "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [5, 5], "kernel_constraint": null, "filters": 24, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_2", "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [5, 5], "kernel_constraint": null, "filters": 36, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_3", "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [5, 5], "kernel_constraint": null, "filters": 48, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_3", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_4", "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "kernel_constraint": null, "filters": 64, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "name": "dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "name": "conv2d_5", "padding": "valid", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "linear", "kernel_size": [3, 3], "kernel_constraint": null, "filters": 64, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "bias_constraint": null, "name": "dense_1", "units": 500, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "bias_constraint": null, "name": "dense_2", "units": 90, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "bias_constraint": null, "name": "dense_3", "units": 30, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}